In [29]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
df = pd.read_csv(r"C:\Users\malus\OneDrive\Desktop\dsbda\Social_Network_Ads (2).csv")
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [31]:
df.Purchased.value_counts()

Purchased
0    257
1    143
Name: count, dtype: int64

In [33]:
df.dtypes

User ID             int64
Gender             object
Age                 int64
EstimatedSalary     int64
Purchased           int64
dtype: object

In [53]:
print(df["Age"].describe())
sns.boxplot(df["Age"])

count    400.000000
mean       0.467976
std        0.249592
min        0.000000
25%        0.279762
50%        0.452381
75%        0.666667
max        1.000000
Name: Age, dtype: float64

In [37]:
df.loc[ df["Gender"] == "Male", "Gender"] = 0
df.loc[ df["Gender"] == "Female", "Gender"] = 1
df

      User ID Gender  Age  EstimatedSalary  Purchased
0    15624510      0   19            19000          0
1    15810944      0   35            20000          0
2    15668575      1   26            43000          0
3    15603246      1   27            57000          0
4    15804002      0   19            76000          0
..        ...    ...  ...              ...        ...
395  15691863      1   46            41000          1
396  15706071      0   51            23000          1
397  15654296      1   50            20000          1
398  15755018      0   36            33000          0
399  15594041      1   49            36000          1

[400 rows x 5 columns]

In [39]:
df.drop(["User ID"], axis=1, inplace=True)
df

    Gender  Age  EstimatedSalary  Purchased
0        0   19            19000          0
1        0   35            20000          0
2        1   26            43000          0
3        1   27            57000          0
4        0   19            76000          0
..     ...  ...              ...        ...
395      1   46            41000          1
396      0   51            23000          1
397      1   50            20000          1
398      0   36            33000          0
399      1   49            36000          1

[400 rows x 4 columns]

In [43]:
def min_max_normalize(feature):
    df[feature] = (df[feature] - df[feature].min()) / (df[feature].max() - df[feature].min())

min_max_normalize("EstimatedSalary")
min_max_normalize("Age")

In [45]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score
import numpy as np
X = np.asarray(df.drop(["Purchased"], axis=1))
y = np.asarray(df["Purchased"])

In [47]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)
model = LogisticRegression()
model.fit(X_train, y_train)
y_pred = model.predict(X_test)
accuracy = accuracy_score(y_test, y_pred)
print("Accuracy:", accuracy)

Accuracy: 0.8416666666666667

In [51]:
tp = ((y_pred == 1) & (y_test == 1)).sum()
tn = ((y_pred == 0) & (y_test == 0)).sum()
fp = ((y_pred == 1) & (y_test == 0)).sum()
fn = ((y_pred == 0) & (y_test == 1)).sum()

recall = tp / (tp + fn) if (tp + fn) != 0 else 0
precision = tp / (tp + fp) if (tp + fp) != 0 else 0
accuracy = (tp + tn) / (tp + tn + fp + fn)
error = 1 - accuracy
f1 = (2 * recall * precision) / (recall + precision) if (recall + precision) != 0 else 0

print("True Positives (TP):", tp)
print("True Negatives (TN):", tn)
print("False Positives (FP):", fp)
print("False Negatives (FN):", fn)
print("Recall:", recall)
print("Precision:", precision)
print("Accuracy:", accuracy)
print("Error Rate:", error)
print("F1 Score:", f1)

True Positives (TP): 29
True Negatives (TN): 72
False Positives (FP): 1
False Negatives (FN): 18
Recall: 0.6170212765957447
Precision: 0.9666666666666667
Accuracy: 0.8416666666666667
Error Rate: 0.15833333333333333
F1 Score: 0.7532467532467533